Autodesk.Revit.DB.Structure.RebarCoverType.Create(Autodesk.Revit.DB.Document,System.String,System.Double)
Creates a new CoverType in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
coverDistance cannot be negative.

Autodesk.Revit.DB.Structure.RebarCoverType.CoverDistance
A distance that can be used as a concrete cover value in a document.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: coverDistance cannot be negative.

Autodesk.Revit.DB.Structure.RebarCoverType
A named value for a clear cover distance.
Remarks:
In Revit Structure, CoverTypes are the rows in the Rebar Cover Settings dialog.